app/views/project/index.html.erb

    <ul>
    <% Project.find(task.id).todos.each do |todotask| %>
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "todos".* FROM "todos" WHERE "todos"."project_id" = $1  [["project_id", 1]]