app/controllers/project_controller.rb

SELECT "projects".* FROM "projects"
---
  def index
    @tasks = Project.all
    @project_type = Project.all.map{|u| [ u.title, u.id ] }

SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "todos" ("text", "isCompleted", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["text", "fdjfdjfjkdfdds f"], ["isCompleted", false], ["project_id", 2], ["created_at", "2020-06-04 15:59:38.663689"], ["updated_at", "2020-06-04 15:59:38.663689"]]
---
  def create
    # render plain: params[:form_add].inspect #|| { "form_add"=>{"title"=>"fdjfdjfjkd", "project_id"=>"2"}, "commit"=>"Save Form add"}
    @project_id = params[:form_add][:project_id]
    @todo_text = params[:form_add][:title]

    @new_todo = Project.find(@project_id).todos.new
    @new_todo.text = @todo_text
    @new_todo.isCompleted = false

    @new_todo.save